In [41]:
!ls

Titanic - Kaggle Competition.ipynb test.csv
bulletPointAdder.py                train.csv
gender_submission.csv

In [42]:
# Import pandas & numpy lib 
import pandas as pd
import numpy as np

In [43]:
!head -4 train.csv

In [13]:
!python3 bulletPointAdder.py

In [ ]:
- - Variable Notes
- - pclass: A proxy for socio-economic status (SES)
- - 1st = Upper
- - 2nd = Middle
- - 3rd = Lower
- - 
- - age: Age is fractional if less than 1. If the age is estimated, is it in the form of xx.5
- - 
- - sibsp: The dataset defines family relations in this way...
- - Sibling = brother, sister, stepbrother, stepsister
- - Spouse = husband, wife (mistresses and fianc√©s were ignored)
- - 
- - parch: The dataset defines family relations in this way...
- - Parent = mother, father
- - Child = daughter, son, stepdaughter, stepson
- - Some children travelled only with a nanny, therefore parch=0 for them.

In [44]:
# Create a dataframe off the titanic train.csv
titanic_train = pd.read_csv('train.csv')
titanic_train.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [51]:
titanic_train.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [48]:
age_array = np.array(titanic_train['Age'])
#age_array

In [6]:
#titanic_train[45:89]

In [9]:
titanic_train.iloc[0,8]

'A/5 21171'

In [10]:
titanic_train[1:4]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S

In [15]:
titanic_series = pd.Series([titanic_train['Name']])
titanic_series

0    0                                Braund, Mr. O...
dtype: object

In [14]:
df_features = pd.DataFrame(titanic_train, columns=['Age','Fare'])
df_features

      Age     Fare
0    22.0   7.2500
1    38.0  71.2833
2    26.0   7.9250
3    35.0  53.1000
4    35.0   8.0500
..    ...      ...
886  27.0  13.0000
887  19.0  30.0000
888   NaN  23.4500
889  26.0  30.0000
890  32.0   7.7500

[891 rows x 2 columns]

In [29]:
df_target = pd.DataFrame(titanic_train, columns=['Survived'])
df_target

     Survived
0           0
1           1
2           1
3           1
4           0
..        ...
886         0
887         1
888         0
889         1
890         0

[891 rows x 1 columns]

In [45]:
target = titanic_train.pop('Survived')
target

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [52]:
titanic_train.head(3)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [54]:
# Series of the age column
age_series = pd.Series(titanic_train['Age'])
age_series

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [34]:
# Import the RandomForestClassifier class from sklearn.ensemble:
from sklearn.ensemble import RandomForestClassifier

In [35]:
# Create a new variable called seed, which will take the value 888 (chosen arbitrarily):
seed = 26

In [36]:
# Instantiate RandomForestClassifier with the random_state=seed 
#parameter and save it into a variable called rf_model:
rf_model = RandomForestClassifier(random_state=seed)

In [38]:
# Train the model with the .fit() method with features and target as parameters:
#rf_model.fit(features, target)

In [ ]:
# Next step, work on missing values
df =